# Самостоятельное задание 1 (+1 балл к оценке за курс).

In [39]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [40]:
#your code here

df1 = pd.concat(map(pd.read_csv, ['/Users/vinogradko/Downloads/Data/Students_info_0.csv', '/Users/vinogradko/Downloads/Data/Students_info_1.csv','/Users/vinogradko/Downloads/Data/Students_info_2.csv', '/Users/vinogradko/Downloads/Data/Students_info_3.csv', '/Users/vinogradko/Downloads/Data/Students_info_4.csv', '/Users/vinogradko/Downloads/Data/Students_info_5.csv', '/Users/vinogradko/Downloads/Data/Students_info_6.csv', '/Users/vinogradko/Downloads/Data/Students_info_7.csv', '/Users/vinogradko/Downloads/Data/Students_info_8.csv', '/Users/vinogradko/Downloads/Data/Students_info_9.csv']))
df2 = pd.concat(map(pd.read_csv, ['/Users/vinogradko/Downloads/Data/Students_marks_0.csv', '/Users/vinogradko/Downloads/Data/Students_marks_1.csv', '/Users/vinogradko/Downloads/Data/Students_marks_2.csv', '/Users/vinogradko/Downloads/Data/Students_marks_3.csv', '/Users/vinogradko/Downloads/Data/Students_marks_4.csv', '/Users/vinogradko/Downloads/Data/Students_marks_5.csv', '/Users/vinogradko/Downloads/Data/Students_marks_6.csv', '/Users/vinogradko/Downloads/Data/Students_marks_7.csv', '/Users/vinogradko/Downloads/Data/Students_marks_8.csv', '/Users/vinogradko/Downloads/Data/Students_marks_9.csv']))
df = pd.concat([df1,df2], sort=False, axis=1)
df.tail()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,index,math score,reading score,writing score
95,995,female,group E,master's degree,standard,completed,group10,995,88,99,95
96,996,male,group C,high school,free/reduced,none,group10,996,62,55,55
97,997,female,group C,high school,free/reduced,completed,group10,997,59,71,65
98,998,female,group D,some college,standard,completed,group10,998,68,78,77
99,999,female,group D,some college,free/reduced,none,group10,999,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [41]:
#your code here

del df['index']
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [44]:
# your code here
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [46]:
# your code here
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [52]:
# your code here

df.isnull().sum().sum()

0

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [57]:
# your code here
df["math score"].mean()

66.089

In [58]:
df["reading score"].mean()

69.169

In [62]:
df["writing score"].mean()

68.054

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [87]:
# your code here

df.loc[df['test preparation course'] == 'none']

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [66]:
# your code here
df.lunch.unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [75]:
# your code here
df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44

**Зафиксируем минимальный балл для сдачи экзамена**

In [89]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [104]:
# your code here
df.loc[df['math score'] > passmark]
#...

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [ ]:
# your code here

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [ ]:
# your code here

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [ ]:
# your code here

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [ ]:
# your code here

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [ ]:
# your code here

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####      90 и больше = A
####      80-89 = B
####      70-79 = C
####      60-69 = D
####      50-59 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [ ]:
def GetGrade(average_mark):
    # your code here    

# your code here